# Lab 7

In [31]:
import pandas as pd

# 1. Read data

In [32]:
df = pd.read_csv("Data/Lab_7_P1_Data.csv", dtype={'BusinessEntityID':str})

print(df.shape)
df.head()

(4, 6)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary
0,01699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,80950
1,01700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,70950
2,01701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,na
3,01702,"Clapper, Dan",clapper@adventure-works.com,(828) 555-0102,03-01-2017,None

In [33]:
df.dtypes

BusinessEntityID    object
EmployeeName        object
EmailAddress        object
PhoneNumber         object
StartDate           object
CurrentSalary       object
dtype: object

# 2. Split columns

In [34]:
two_new_cols = ['Last_Name', 'First_Name']

df[two_new_cols] = df['EmployeeName'].str.split(',',1, expand=True)

print(df.shape)
df.head()

(4, 8)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,Last_Name,First_Name
0,01699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,80950,Robinett,David
1,01700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,70950,Robinson,Rebecca
2,01701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,na,Robinson,Dorothy
3,01702,"Clapper, Dan",clapper@adventure-works.com,(828) 555-0102,03-01-2017,None,Clapper,Dan

In [35]:
two_new_cols = ['AreaCode', 'Delete1']

df[two_new_cols] = df['PhoneNumber'].str.split(')',1, expand=True)

print(df.shape)
df.head()

(4, 10)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,Last_Name,First_Name,AreaCode,Delete1
0,01699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,80950,Robinett,David,(827,525-0100
1,01700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,70950,Robinson,Rebecca,(829,525-0101
2,01701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,na,Robinson,Dorothy,(828,555-0102
3,01702,"Clapper, Dan",clapper@adventure-works.com,(828) 555-0102,03-01-2017,None,Clapper,Dan,(828,555-0102

In [36]:
two_new_cols = ['Delete2', 'Area_Code']

df[two_new_cols] = df['AreaCode'].str.split('(',1, expand=True)

print(df.shape)
df.head()

(4, 12)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,Last_Name,First_Name,AreaCode,Delete1,Delete2,Area_Code
0,01699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,80950,Robinett,David,(827,525-0100,,827
1,01700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,70950,Robinson,Rebecca,(829,525-0101,,829
2,01701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,na,Robinson,Dorothy,(828,555-0102,,828
3,01702,"Clapper, Dan",clapper@adventure-works.com,(828) 555-0102,03-01-2017,None,Clapper,Dan,(828,555-0102,,828

# 3. Drop columns

In [37]:
df.drop(["EmployeeName", "EmailAddress", "PhoneNumber", 'AreaCode', 'Delete1', 'Delete2'], axis='columns', inplace=True)
df.head()

  BusinessEntityID   StartDate CurrentSalary Last_Name First_Name Area_Code
0            01699  06-05-2010         80950  Robinett      David       827
1            01700  05-01-2015         70950  Robinson    Rebecca       829
2            01701  03-01-2017            na  Robinson    Dorothy       828
3            01702  03-01-2017          None   Clapper        Dan       828

# 4. Rename Columns

In [38]:
cols_to_rename = {
                   'BusinessEntityID':'ID', 
                   'StartDate' : 'Start_Date', 
                   'CurrentSalary' : 'Current_Salary'
                 }
df.rename(columns = cols_to_rename, inplace=True)

print(df.shape)
df.head()

(4, 6)

      ID  Start_Date Current_Salary Last_Name First_Name Area_Code
0  01699  06-05-2010          80950  Robinett      David       827
1  01700  05-01-2015          70950  Robinson    Rebecca       829
2  01701  03-01-2017             na  Robinson    Dorothy       828
3  01702  03-01-2017           None   Clapper        Dan       828

# 5. Changing data types

In [39]:
df.dtypes

ID                object
Start_Date        object
Current_Salary    object
Last_Name         object
First_Name        object
Area_Code         object
dtype: object

In [40]:
df['Start_Date'] = pd.to_datetime(df['Start_Date'])

In [41]:
df['Current_Salary'] = df['Current_Salary'].str.replace("na", "")
df['Current_Salary'] = df['Current_Salary'].str.replace("None", "")

df['Current_Salary'] = pd.to_numeric(df['Current_Salary']).astype(float)

In [42]:
df.dtypes

ID                        object
Start_Date        datetime64[ns]
Current_Salary           float64
Last_Name                 object
First_Name                object
Area_Code                 object
dtype: object

# 6. Reorder columns

In [44]:
cols_to_keep = ['ID', 'Last_Name', 'First_Name', 'Current_Salary', 'Area_Code', 'Start_Date']
df = df[cols_to_keep]

print("Lab 7")
print(df.shape)
df.head()

Lab 7
(4, 6)

      ID Last_Name First_Name  Current_Salary Area_Code Start_Date
0  01699  Robinett      David         80950.0       827 2010-06-05
1  01700  Robinson    Rebecca         70950.0       829 2015-05-01
2  01701  Robinson    Dorothy             NaN       828 2017-03-01
3  01702   Clapper        Dan             NaN       828 2017-03-01

In [45]:
df.dtypes

ID                        object
Last_Name                 object
First_Name                object
Current_Salary           float64
Area_Code                 object
Start_Date        datetime64[ns]
dtype: object